L01-V02-SumaDeVectores-I.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2024-12-23 lun 15:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lección 1 del curso - Vídeo 2</title>
<meta name="author" content="Marcos Bujosa" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Lección 1 del curso - Vídeo 2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga99c304">1. Suma de Vectores de \R[n] - Vídeo 02</a>
<ul>
<li><a href="#org3dbd89e">1.1. Escena 1 - Suma de vectores de \R[n]</a></li>
<li><a href="#org9dd0ee6">1.2. Escena 2 - Propiedad conmutativa de la suma</a></li>
</ul>
</li>
<li><a href="#orgf71fdc5">2. Trozos comunes de código</a>
<ul>
<li><a href="#org0997ddd">2.1. Carga de la librería Manim y NacAL</a></li>
<li><a href="#orgb633191">Definición de algunas subclases con definiciones generales</a></li>
</ul>
</li>
<li><a href="#org4d070db">3. Rodando: 1,2,3&hellip; ¡acción!</a></li>
</ul>
</div>
</div>
<p>
\maketitle
</p>
<div id="outline-container-orga99c304" class="outline-2">
<h2 id="orga99c304"><span class="section-number-2">1.</span> Suma de Vectores de \R[n] - Vídeo 02</h2>
<div class="outline-text-2" id="text-1">
</div>
