L01-V02-SumaDeVectores-I.html
<div id="outline-container-org3dbd89e" class="outline-3">
<h3 id="org3dbd89e"><span class="section-number-3">1.1.</span> Escena 1 - Suma de vectores de \R[n]</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python" id="org72d9404">&lt;&lt;Carga de la librer&#237;a Manim y NacAL con AzureService&gt;&gt;
&lt;&lt;Definici&#243;n de mi escena con voz&gt;&gt;

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V02_E01_SumaDeVectores</span>(MiEscenaConVoz):    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )       
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))       </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"""\usepackage{nacal} """</span>)

        <span style="color: #0000FF;">self</span>.creditos()
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Portada</span>
        <span style="color: #BA36A5;">titulo</span> = Title(_(<span style="color: #008000;">"Suma de vectores en "</span>) + r<span style="color: #008000;">"\R[n]"</span>,
                     tex_template = myTemplate,
                     font_size=70).set_color(BLUE)
        <span style="color: #0000FF;">self</span>.play(Write(titulo))
        <span style="color: #0000FF;">self</span>.pausa_media()
        <span style="color: #0000FF;">self</span>.play(FadeOut(titulo))
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Definici&#243;n de vector suma</span>
        <span style="color: #BA36A5;">operacionSuma</span> = Tex(_(<span style="color: #008000;">"Suma de vectores"</span>),
                         tex_template = myTemplate, font_size=70
                         ).to_edge(UP).set_color(BLUE)

        <span style="color: #BA36A5;">operacionDescripcion</span> = Tex(_(<span style="color: #008000;">"La suma se define componente a componente."</span>),
                         tex_template = myTemplate,
                         ).move_to([0,2.5,0]).to_edge(LEFT)
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Ejemplos</span>
        <span style="color: #BA36A5;">EjR3</span> = Tex(r<span style="color: #008000;">"\textbf{"</span> + _(<span style="color: #008000;">"Ejemplo en "</span>) + r<span style="color: #008000;">"\R[3]:}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(operacionDescripcion, DOWN, aligned_edge=LEFT)

        <span style="color: #BA36A5;">EjR4</span> = Tex(r<span style="color: #008000;">"\textbf{"</span> + _(<span style="color: #008000;">"Ejemplo en "</span>) + r<span style="color: #008000;">"\R[4]:}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(operacionDescripcion, DOWN, aligned_edge=LEFT)
        
        <span style="color: #BA36A5;">a</span>    = nc.Vector( [0, 3, 6])        
        <span style="color: #BA36A5;">b</span>    = nc.Vector( [5, 1, 2])        
        <span style="color: #BA36A5;">s1</span> = MathTex(a.latex(),        tex_template = myTemplate,)
        <span style="color: #BA36A5;">mas</span>= MathTex(r<span style="color: #008000;">"+"</span>,             tex_template = myTemplate,)
        <span style="color: #BA36A5;">s3</span> = MathTex(b.latex(),        tex_template = myTemplate,)
        <span style="color: #BA36A5;">igual</span> = MathTex(r<span style="color: #008000;">"="</span>,             tex_template = myTemplate,)
        <span style="color: #BA36A5;">s5</span> = MathTex((a+b).latex(),    tex_template = myTemplate,)
        <span style="color: #BA36A5;">grp1</span> = VGroup(s1,mas,s3,igual,s5).arrange(RIGHT)
       
        <span style="color: #0000FF;">self</span>.add(operacionSuma)
        <span style="color: #0000FF;">self</span>.add(operacionDescripcion)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Podemos sumar dos vectores si ambos poseen el mismo n&#250;mero de</span>
<span style="color: #008000;">        componentes."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(EjR3)
            <span style="color: #0000FF;">self</span>.add(grp1[0])
            <span style="color: #0000FF;">self</span>.add(grp1[2])

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""El resultado es otro vector que se define componente a</span>
<span style="color: #008000;">        componente."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(grp1[1])
            <span style="color: #0000FF;">self</span>.pausa_media()
            <span style="color: #0000FF;">self</span>.add(grp1[3])
            <span style="color: #0000FF;">self</span>.add(grp1[4][0][:2])
            <span style="color: #0000FF;">self</span>.add(grp1[4][0][-2:])

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""La primera es la suma de las primeras componentes de ambos</span>
<span style="color: #008000;">        vectores."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[4][0][2]), run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(grp1[0][0][2]), Circumscribe(grp1[2][0][2]), run_time=tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.pausa_corta()
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""La segunda es la suma de las segundas."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[4][0][3]), run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(grp1[0][0][3]), Circumscribe(grp1[2][0][3]), run_time=tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.pausa_corta()
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y as&#237; con todas las componentes del vector suma."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[4][0][4]))
            <span style="color: #0000FF;">self</span>.pausa_corta()
            <span style="color: #0000FF;">self</span>.play(Circumscribe(grp1[0][0][4]), Circumscribe(grp1[2][0][4]) )
            <span style="color: #0000FF;">self</span>.pausa_corta(.3)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp1))

        <span style="color: #0000FF;">self</span>.pausa()

        <span style="color: #BA36A5;">v_generico_a</span>  = nc.Vector(sp.symbols(<span style="color: #008000;">'a:5'</span>)[1:])
        <span style="color: #BA36A5;">vga</span> = MathTex(v_generico_a.latex(), tex_template = myTemplate)
        
        <span style="color: #BA36A5;">v_generico_b</span>  = nc.Vector(sp.symbols(<span style="color: #008000;">'b:5'</span>)[1:])
        <span style="color: #BA36A5;">vgb</span> = MathTex(v_generico_b.latex(), tex_template = myTemplate)

        <span style="color: #BA36A5;">vgab</span> = MathTex((v_generico_a + v_generico_b).latex(), tex_template = myTemplate)

        <span style="color: #BA36A5;">grp2</span> = VGroup(vga,mas,vgb,igual,vgab).arrange(RIGHT)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por tanto, la siguiente expresi&#243;n describe</span>
<span style="color: #008000;">        la suma de vectores en R 4."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeTransform(EjR3,EjR4))
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp2))
            <span style="color: #0000FF;">self</span>.pausa()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Definir la suma en R n requiere una estrategia distinta; una que no</span>
<span style="color: #008000;">        necesite escribir la lista completa de componentes. Piense que</span>
<span style="color: #008000;">        la lista puede ser muy larga cuando n es grande."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(Indicate(vga[0][4:-4]), Indicate(vgb[0][4:-4]), Indicate(vgab[0][4:-4]), run_time=2)
            <span style="color: #0000FF;">self</span>.pausa_corta()

        <span style="color: #BA36A5;">Defn</span> = Tex(r<span style="color: #008000;">"\textbf{"</span> + _(<span style="color: #008000;">"Definici&#243;n"</span>) + <span style="color: #008000;">":}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(RED).next_to(operacionDescripcion, DOWN, aligned_edge=LEFT)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Una alternativa es definir la suma usando la notaci&#243;n</span>
<span style="color: #008000;">        descrita en el v&#237;deo anterior. Con ella podemos expresar"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp2), FadeOut(EjR4), run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.add(Defn)

        <span style="color: #BA36A5;">cvab</span> = MathTex(r<span style="color: #008000;">"\elemRp{\Vect{a}+\Vect{b}}{i}"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">cva</span>  = MathTex(r<span style="color: #008000;">"\eleVR{a}{i}"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">cvb</span>  = MathTex(r<span style="color: #008000;">"\eleVR{b}{i}"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">eq_suma</span> = VGroup(cvab,igual,cva,mas,cvb).arrange(RIGHT).scale(1.5)
        
        <span style="color: #BA36A5;">donde</span> = Tex(_(<span style="color: #008000;">"donde"</span>))
        <span style="color: #BA36A5;">indices</span> = MathTex(r<span style="color: #008000;">"i=1:n"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">pc_indices</span> = VGroup(donde,indices).arrange(RIGHT, buff=1)
        <span style="color: #BA36A5;">grp3</span> = VGroup(eq_suma, pc_indices).arrange(RIGHT, buff=1)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""que la componente i-&#233;sima del vector suma es igual a la suma</span>
<span style="color: #008000;">        de las i-&#233;simas componentes de los vectores."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3[0][:2],
                             scale=1.5,
                             rate_func=rate_functions.exponential_decay),
                      run_time=2*tracker.duration/5)
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3[0][2:],
                             scale=0.5,
                             rate_func=rate_functions.exponential_decay),
                      run_time=3*tracker.duration/5)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(r<span style="color: #008000;">"""(donde el &#237;ndice recorre los n&#250;meros naturales entre uno</span>
<span style="color: #008000;">        y n)"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3[1]))
            <span style="color: #0000FF;">self</span>.pausa_corta()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(r<span style="color: #008000;">"""Esta definici&#243;n abstracta ser&#225; muy util para demostrar algunas</span>
<span style="color: #008000;">        propiedades de las operaciones con vectores, pues arroja una</span>
<span style="color: #008000;">        primera regla de c&#225;lculo simb&#243;lico:"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.play(Indicate(eq_suma[0][0][0]),
                      Indicate(eq_suma[0][0][-3:]),
                      Indicate(eq_suma[2][0][-2:]),
                      Indicate(eq_suma[4][0][-2:]),
                      run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.pausa_muy_corta()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(r<span style="color: #008000;">"""que la suma de las i-&#233;simas componentes se puede sustituir por</span>
<span style="color: #008000;">        la i-&#233;sima componente del vector suma."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #BA36A5;">source0</span> = MathTex(r<span style="color: #008000;">"\eleVR{a}{i}+\eleVR{b}{i}"</span>,
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=1.2).scale(2)[0]
            <span style="color: #BA36A5;">target0</span> = MathTex(r<span style="color: #008000;">"\elemRp{\Vect{a}+\Vect{b}}{i}"</span>,
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=1.2).scale(2)[0]
            <span style="color: #BA36A5;">source1</span> = target0.copy()
            <span style="color: #BA36A5;">target1</span> = source0.copy()
            
            VGroup(source0,target0)
            <span style="color: #0000FF;">self</span>.add(source0)
            <span style="color: #BA36A5;">transform_index0</span> = [[0,1,2,3,4,5,6],
                                [1,0,4,2,3,5,6]]
            <span style="color: #0000FF;">self</span>.play(
                *[
                    ReplacementTransform(source0[i],target0[j], rate_func=rate_functions.smooth)
                    <span style="color: #0000FF;">for</span> i,j <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(*transform_index0)
                ],
                run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y la i-&#233;sima componente de una suma se puede sustituir por la</span>
<span style="color: #008000;">        suma de las i-&#233;simas componentes."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.play(ReplacementTransform(target0,source1))
            
            VGroup(source1,target1)
            <span style="color: #BA36A5;">transform_index1</span> = [[0,1,2,3,4,5,6],
                                [1,0,3,4,2,5,6]]
            <span style="color: #0000FF;">self</span>.play(
                *[
                    ReplacementTransform(source1[i],target1[j], rate_func=rate_functions.smooth)
                    <span style="color: #0000FF;">for</span> i,j <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(*transform_index1)
                ],
                run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Esta regla se denomina propiedad distributiva del operador selector</span>
<span style="color: #008000;">        respecto de la suma."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.play(FadeOut(target1))
            <span style="color: #0000FF;">self</span>.play(Indicate(eq_suma[0][0][0]),
                      Indicate(eq_suma[0][0][-3:]),
                      Indicate(eq_suma[2][0][-2:]),
                      Indicate(eq_suma[4][0][-2:]),
                      run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.pausa()
            
</pre>
</div>
</div>
</div>
