L01-V02-SumaDeVectores-I.org
** Escena 2 - Propiedad conmutativa de la suma

# +call: rodando(fichero="L01_V02_SumaDeVectores-I", escena=" 2")
# +call: rodandoHD(fichero="L01_V02_SumaDeVectores-I", escena="2")

# file:lib/media/videos/L01_V02_SumaDeVectores-I/480p15/L01_V02_E02_PropiedadConmutativaDeLaSuma.mp4]]

#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V02_SumaDeVectores-I.py
class L01_V02_E02_PropiedadConmutativaDeLaSuma(MiEscenaConVoz):    
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )       
        #self.set_speech_service(GTTSService(lang="es", tld="com"))        
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"""\usepackage{nacal} """)

        self.creditos(7)
        	
        operacionSuma = Tex(_("Suma de vectores en ") + r"\R[n]",
                            tex_template = myTemplate,
                            font_size=70).to_edge(UP).set_color(BLUE)        
        self.add(operacionSuma)
        
        source0  = MathTex(r"\elemRp{\Vect{a}+\Vect{b}}{i}", tex_template = myTemplate).scale(2)[0]
        source1  = source0.copy()
        target0  = MathTex(r"\elemRp{\Vect{b}+\Vect{a}}{i}", tex_template = myTemplate).scale(2)[0]
        igual = MathTex(r"=",             tex_template = myTemplate,).scale(2)[0]
        vgr0  = VGroup(source0, igual, source1).arrange(RIGHT, buff=1)
        vgr1  = VGroup(source0, igual, target0).arrange(RIGHT, buff=1)
        transform_index0 = [[1,2,3],
                            [3,2,1]]

        with self.voiceover(text=_("""Usemos la anterior regla de cálculo simbólico para demostrar la
        propiedad conmutativa de la suma. Es decir, que el orden en que se sumen los vectores es
        irrelevante.""")) as tracker:
            self.play(FadeIn(source0[1:-3]), FadeIn(vgr1[1]), FadeIn(source1[1:-3]))
            self.pausa(tracker.duration/2)
            self.play(
                ,*[
                    ReplacementTransform(vgr0[2][i],vgr1[2][j], rate_func=rate_functions.smooth)
                    for i,j in zip(*transform_index0)
                ],
                run_time=tracker.duration/2)
            self.pausa_corta()
            
        with self.voiceover(text=_("""Sabemos que dos vectores son iguales si lo son sus correspondientes
        listas de componentes. Por tanto, para demostrar la igualdad entre vectores debemos probar
        la igualdad componente a componente.""")) as tracker:           
            self.pausa(tracker.duration*2/5)
            self.play(FadeIn(source0[0]), FadeIn(source0[-3:]), FadeIn(target0[0]), FadeIn(target0[-3:]) )
            self.pausa(tracker.duration/4)
            self.play(Indicate(source0[-2:]), Indicate(target0[-2:]), run_time=tracker.duration/4)
            self.pausa_corta()

        with self.voiceover(text=_("""Para ello comenzaremos escribiendo uno cualquiera de sus lados.
        Después operaremos hasta obtener la expresión del lado opuesto de la igualdad.""")) as tracker:            
            self.pausa(tracker.duration/4)
            self.play(Indicate(vgr0[0]))
            self.play(Indicate(vgr1[2]))

        vgr2=vgr1.copy().scale(1/2).next_to(operacionSuma, DOWN).to_edge(LEFT)
        vgr3=vgr1.copy().scale(1/2).to_edge(LEFT)
        item1 = MathTex(r"\eleVR{x}{i} \in \R",tex_template = myTemplate)
        item2 = MathTex(r"\alpha + \beta = \beta + \alpha\quad (\alpha,\beta\in\R)",
                        tex_template = myTemplate)
        item3 = MathTex(r"\elemRp*{\Vect{x}+\Vect{y}}{i} = \eleVR{x}{i} + \eleVR{y}{i}",
                        tex_template = myTemplate)
        items = VGroup(item1,
                       item2,
                       item3).arrange(DOWN).scale(.8).align_to(vgr2, UP).to_edge(RIGHT).shift(DOWN*0.15)        
        box =  SurroundingRectangle(items, color=YELLOW )

        paso1 = MathTex(r"=\eleVR{a}{i}+\eleVR{b}{i}",
                        tex_template = myTemplate).next_to(vgr3[0], RIGHT)
        paso2 = MathTex(r"=\eleVR{b}{i}+\eleVR{a}{i}",
                        tex_template = myTemplate).next_to(paso1, DOWN, aligned_edge=LEFT)
        paso3 = MathTex(r"=\elemRp{\Vect{b}+\Vect{a}}{i}",
                        tex_template = myTemplate).next_to(paso2, DOWN, aligned_edge=LEFT)
        demo = VGroup(paso1, paso2, paso3)
        
        with self.voiceover(text=_("""Con operar nos referimos a sustituir una expresión por otra que sabemos
        que es equivalente. Para esta demostración solo necesitamos considerar tres cosas""")) as tracker:
            self.play(FadeTransformPieces(vgr1,vgr2),
                      run_time=tracker.duration/2 )
            self.add(box,items)
            self.pausa_muy_larga()

        with self.voiceover(text=_("""que los elementos de un vector son números reales,
        que entre números reales la suma es conmutativa,
        y que el operador selector es distributivo respecto de la suma""")) as tracker:
            self.play(Indicate(items[0]), run_time=tracker.duration/3 )
            self.play(Indicate(items[1]), run_time=tracker.duration/3 )
            self.play(Indicate(items[2]), run_time=tracker.duration/3 )
            
        with self.voiceover(text=_("""Comencemos escribiendo uno de los lados,
        por ejemplo el izquierdo.""")) as tracker:
            self.play( FadeTransformPieces(vgr2[0].copy(),vgr3[0]),
                       FadeToColor(vgr2[0], color=TEAL),
                       run_time=tracker.duration/2 )
            self.pausa_media()
            
        with self.voiceover(text=_("""En primer lugar,
        el operador selector es distributivo respecto de la suma""")) as tracker:
            self.play(Indicate(items[2], run_time=tracker.duration/2) )
            self.play(FadeIn(demo[0],    run_time=tracker.duration/2) )
            
        with self.voiceover(text=_("""En segundo lugar, dado que los componentes son números reales,
        el resultado no cambia si intercambiamos el orden de su suma.""")) as tracker:            
            self.play(Indicate(items[:2], run_time=tracker.duration/2) )
            self.play(FadeIn(demo[1],     run_time=tracker.duration/2) )
            
        with self.voiceover(text=_("""Por último,
        el operador selector es distributivo respecto de la suma""")) as tracker:
            self.play(Indicate(items[2], run_time=tracker.duration/2) )
            self.play(FadeIn(demo[2],    run_time=tracker.duration/2) )

        with self.voiceover(text=_("""Con esto termina la demostración.""")) as tracker:
            self.play(FadeToColor(vgr2[0], color=TEAL))
            self.play(Indicate(vgr3[0]),
                      Indicate(demo[2]),
                      FadeToColor(vgr2[1:], color=TEAL),
                      run_time=tracker.duration)
            self.pausa()

        with self.voiceover(text=_("""En el próximo vídeo daremos una interprtación
        geométrica de la suma de vectores.""")) as tracker:
            self.pausa_muy_larga()
            
#+END_SRC

#+RESULTS:

# +call: rodando(fichero="L01_V02_SumaDeVectores-I", escena=" 2")
# +call: rodandoHD(fichero="L01_V02_SumaDeVectores-I", escena="2")

# file:lib/media/videos/L01_V02_SumaDeVectores-I/480p15/L01_V02_E02_PropiedadConmutativaDeLaSuma.mp4]]

# +latex: \newpage


