L01-V02-SumaDeVectores-I.html
<div id="outline-container-org9dd0ee6" class="outline-3">
<h3 id="org9dd0ee6"><span class="section-number-3">1.2.</span> Escena 2 - Propiedad conmutativa de la suma</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V02_E02_PropiedadConmutativaDeLaSuma</span>(MiEscenaConVoz):    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )       
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))        </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"""\usepackage{nacal} """</span>)

        <span style="color: #0000FF;">self</span>.creditos(7)
                
        <span style="color: #BA36A5;">operacionSuma</span> = Tex(_(<span style="color: #008000;">"Suma de vectores en "</span>) + r<span style="color: #008000;">"\R[n]"</span>,
                            tex_template = myTemplate,
                            font_size=70).to_edge(UP).set_color(BLUE)        
        <span style="color: #0000FF;">self</span>.add(operacionSuma)
        
        <span style="color: #BA36A5;">source0</span>  = MathTex(r<span style="color: #008000;">"\elemRp{\Vect{a}+\Vect{b}}{i}"</span>, tex_template = myTemplate).scale(2)[0]
        <span style="color: #BA36A5;">source1</span>  = source0.copy()
        <span style="color: #BA36A5;">target0</span>  = MathTex(r<span style="color: #008000;">"\elemRp{\Vect{b}+\Vect{a}}{i}"</span>, tex_template = myTemplate).scale(2)[0]
        <span style="color: #BA36A5;">igual</span> = MathTex(r<span style="color: #008000;">"="</span>,             tex_template = myTemplate,).scale(2)[0]
        <span style="color: #BA36A5;">vgr0</span>  = VGroup(source0, igual, source1).arrange(RIGHT, buff=1)
        <span style="color: #BA36A5;">vgr1</span>  = VGroup(source0, igual, target0).arrange(RIGHT, buff=1)
        <span style="color: #BA36A5;">transform_index0</span> = [[1,2,3],
                            [3,2,1]]

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Usemos la anterior regla de c&#225;lculo simb&#243;lico para demostrar la</span>
<span style="color: #008000;">        propiedad conmutativa de la suma. Es decir, que el orden en que se sumen los vectores es</span>
<span style="color: #008000;">        irrelevante."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(source0[1:-3]), FadeIn(vgr1[1]), FadeIn(source1[1:-3]))
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(
                *[
                    ReplacementTransform(vgr0[2][i],vgr1[2][j], rate_func=rate_functions.smooth)
                    <span style="color: #0000FF;">for</span> i,j <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(*transform_index0)
                ],
                run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.pausa_corta()
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Sabemos que dos vectores son iguales si lo son sus correspondientes</span>
<span style="color: #008000;">        listas de componentes. Por tanto, para demostrar la igualdad entre vectores debemos probar</span>
<span style="color: #008000;">        la igualdad componente a componente."""</span>)) <span style="color: #0000FF;">as</span> tracker:           
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration*2/5)
            <span style="color: #0000FF;">self</span>.play(FadeIn(source0[0]), FadeIn(source0[-3:]), FadeIn(target0[0]), FadeIn(target0[-3:]) )
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/4)
            <span style="color: #0000FF;">self</span>.play(Indicate(source0[-2:]), Indicate(target0[-2:]), run_time=tracker.duration/4)
            <span style="color: #0000FF;">self</span>.pausa_corta()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Para ello comenzaremos escribiendo uno cualquiera de sus lados.</span>
<span style="color: #008000;">        Despu&#233;s operaremos hasta obtener la expresi&#243;n del lado opuesto de la igualdad."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/4)
            <span style="color: #0000FF;">self</span>.play(Indicate(vgr0[0]))
            <span style="color: #0000FF;">self</span>.play(Indicate(vgr1[2]))

        <span style="color: #BA36A5;">vgr2</span>=vgr1.copy().scale(1/2).next_to(operacionSuma, DOWN).to_edge(LEFT)
        <span style="color: #BA36A5;">vgr3</span>=vgr1.copy().scale(1/2).to_edge(LEFT)
        <span style="color: #BA36A5;">item1</span> = MathTex(r<span style="color: #008000;">"\eleVR{x}{i} \in \R"</span>,tex_template = myTemplate)
        <span style="color: #BA36A5;">item2</span> = MathTex(r<span style="color: #008000;">"\alpha + \beta = \beta + \alpha\quad (\alpha,\beta\in\R)"</span>,
                        tex_template = myTemplate)
        <span style="color: #BA36A5;">item3</span> = MathTex(r<span style="color: #008000;">"\elemRp*{\Vect{x}+\Vect{y}}{i} = \eleVR{x}{i} + \eleVR{y}{i}"</span>,
                        tex_template = myTemplate)
        <span style="color: #BA36A5;">items</span> = VGroup(item1,
                       item2,
                       item3).arrange(DOWN).scale(.8).align_to(vgr2, UP).to_edge(RIGHT).shift(DOWN*0.15)        
        <span style="color: #BA36A5;">box</span> =  SurroundingRectangle(items, color=YELLOW )

        <span style="color: #BA36A5;">paso1</span> = MathTex(r<span style="color: #008000;">"=\eleVR{a}{i}+\eleVR{b}{i}"</span>,
                        tex_template = myTemplate).next_to(vgr3[0], RIGHT)
        <span style="color: #BA36A5;">paso2</span> = MathTex(r<span style="color: #008000;">"=\eleVR{b}{i}+\eleVR{a}{i}"</span>,
                        tex_template = myTemplate).next_to(paso1, DOWN, aligned_edge=LEFT)
        <span style="color: #BA36A5;">paso3</span> = MathTex(r<span style="color: #008000;">"=\elemRp{\Vect{b}+\Vect{a}}{i}"</span>,
                        tex_template = myTemplate).next_to(paso2, DOWN, aligned_edge=LEFT)
        <span style="color: #BA36A5;">demo</span> = VGroup(paso1, paso2, paso3)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Con operar nos referimos a sustituir una expresi&#243;n por otra que sabemos</span>
<span style="color: #008000;">        que es equivalente. Para esta demostraci&#243;n solo necesitamos considerar tres cosas"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeTransformPieces(vgr1,vgr2),
                      run_time=tracker.duration/2 )
            <span style="color: #0000FF;">self</span>.add(box,items)
            <span style="color: #0000FF;">self</span>.pausa_muy_larga()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""que los elementos de un vector son n&#250;meros reales,</span>
<span style="color: #008000;">        que entre n&#250;meros reales la suma es conmutativa,</span>
<span style="color: #008000;">        y que el operador selector es distributivo respecto de la suma"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(items[0]), run_time=tracker.duration/3 )
            <span style="color: #0000FF;">self</span>.play(Indicate(items[1]), run_time=tracker.duration/3 )
            <span style="color: #0000FF;">self</span>.play(Indicate(items[2]), run_time=tracker.duration/3 )
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Comencemos escribiendo uno de los lados,</span>
<span style="color: #008000;">        por ejemplo el izquierdo."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play( FadeTransformPieces(vgr2[0].copy(),vgr3[0]),
                       FadeToColor(vgr2[0], color=TEAL),
                       run_time=tracker.duration/2 )
            <span style="color: #0000FF;">self</span>.pausa_media()
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""En primer lugar,</span>
<span style="color: #008000;">        el operador selector es distributivo respecto de la suma"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(items[2], run_time=tracker.duration/2) )
            <span style="color: #0000FF;">self</span>.play(FadeIn(demo[0],    run_time=tracker.duration/2) )
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""En segundo lugar, dado que los componentes son n&#250;meros reales,</span>
<span style="color: #008000;">        el resultado no cambia si intercambiamos el orden de su suma."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.play(Indicate(items[:2], run_time=tracker.duration/2) )
            <span style="color: #0000FF;">self</span>.play(FadeIn(demo[1],     run_time=tracker.duration/2) )
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por &#250;ltimo,</span>
<span style="color: #008000;">        el operador selector es distributivo respecto de la suma"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(items[2], run_time=tracker.duration/2) )
            <span style="color: #0000FF;">self</span>.play(FadeIn(demo[2],    run_time=tracker.duration/2) )

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Con esto termina la demostraci&#243;n."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeToColor(vgr2[0], color=TEAL))
            <span style="color: #0000FF;">self</span>.play(Indicate(vgr3[0]),
                      Indicate(demo[2]),
                      FadeToColor(vgr2[1:], color=TEAL),
                      run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.pausa()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""En el pr&#243;ximo v&#237;deo daremos una interprtaci&#243;n</span>
<span style="color: #008000;">        geom&#233;trica de la suma de vectores."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa_muy_larga()
            
</pre>
</div>
</div>
</div>
</div>
