L01-V02-SumaDeVectores-I.org
* Trozos comunes de código

** Carga de la librería Manim y NacAL

#+name: Carga de la librería Manim y NacAL
#+BEGIN_SRC python :exports none :results discard
from manim import *
from manim_voiceover import VoiceoverScene
from manim_voiceover.services.gtts import GTTSService
import nacal as nc
import sympy as sp

# PARA LA TRADUCCIÓN (pero no me ha funcionado)

#from manim_voiceover.translate import get_gettext
# # It is good practice to get the LOCALE and DOMAIN from environment variables
#import os
#LOCALE = os.getenv("LOCALE")
#DOMAIN = os.getenv("DOMAIN")
# The following function uses LOCALE and DOMAIN to set the language, and
# returns a gettext function that is used to insert translations.
#_ = get_gettext()
#+END_SRC


#+name: Carga de la librería Manim y NacAL con AzureService
#+BEGIN_SRC python :results discard
from manim import *
from manim_voiceover import VoiceoverScene
from manim_voiceover.services.azure import AzureService
import nacal as nc
import sympy as sp
# PARA LA TRADUCCIÓN (pero no sé generar los vídeos traducidos)
from manim_voiceover.translate import get_gettext
# It is good practice to get the LOCALE and DOMAIN from environment variables
import os
LOCALE = os.getenv("LOCALE")
DOMAIN = os.getenv("DOMAIN")
# The following function uses LOCALE and DOMAIN to set the language, and
# returns a gettext function that is used to insert translations.
_ = get_gettext()
#+END_SRC

#+RESULTS: Carga de la librería Manim y NacAL con AzureService

** Definición de algunas subclases con definiciones generales 
  :PROPERTIES:  
  :UNNUMBERED: t  
  :END:  

#+name: Definición de mi escena con voz
#+BEGIN_SRC python :noweb no-export :results discard

class MiEscenaConVoz(VoiceoverScene):
    def pausa_muy_corta(self, n=0.3):
        self.wait(n)
    def pausa_corta(self, n=0.5):
        self.wait(n)
    def pausa(self, n=1):
        self.wait(n)
    def pausa_media(self, n=1.5):
        self.wait(n)
    def pausa_larga(self, n=3):
        self.wait(n)
    def pausa_muy_larga(self, n=5):
        self.wait(n)

    <<Créditos en distintas partes de la pantalla>>
         
#+END_SRC

#    mas    = MathTex("+")
#    igual  = MathTex("=")
#    donde  = Tex("donde")
#    pycoma = Tex(";")


#+name: Créditos en distintas partes de la pantalla
#+BEGIN_SRC python :results discard
def creditos(self, variante=1):
    def analisis_opcion_elegida(tipo):
        'Análisis de las opciones de eliminación elegidas'
        lista = [100,20,10,4,2,1]
        opcion = set()
        for t in lista:
            if (tipo - (tipo % t)) in lista:
                opcion.add(tipo - (tipo % t))
                tipo = tipo % t
        return opcion    
    copyright = Tex(r"\textcopyright{\;} 2024\; Marcos Bujosa  ")
    if 1 in analisis_opcion_elegida(variante):
        stampDcha  = VGroup(copyright.copy()).rotate( PI/2).scale(0.5).to_edge(RIGHT, buff=0.1).set_color(GRAY_D)
        self.add(stampDcha)
    if 2 in analisis_opcion_elegida(variante):
        stampIzda  = VGroup(copyright.copy()).rotate(-PI/2).scale(0.5).to_edge(LEFT, buff=0.1).set_color(GRAY_D)
        self.add(stampIzda)
    if 4 in analisis_opcion_elegida(variante):
        stampBottom= VGroup(copyright.copy()).rotate(    0).scale(0.5).to_edge(DOWN, buff=0.1).set_color(GRAY_D)
        self.add(stampBottom)
    if 10 in analisis_opcion_elegida(variante):
        stampTop   = VGroup(copyright.copy()).rotate(    0).scale(0.5).to_edge(  UP, buff=0.1).set_color(GRAY_D)
        self.add(stampTop)
        
#+END_SRC

# ** Creditos

#+name: copyright
#+BEGIN_SRC python :noweb tangle :results discard
class ZCreditos(Scene):
    def construct(self):
        copyright = Tex(r"\textcopyright{\;} 2024 \; Marcos Bujosa")
        github = Tex(r"\texttt{https://github.com/mbujosab}").next_to(copyright, DOWN)
        CGG  = VGroup(copyright,github).scale(1.1)
        self.add(CGG)
        self.wait(10)
#+END_SRC

# +call: rodando(fichero="L01_V02_SumaDeVectores-I", escena="4")

# +call: rodandoHD(fichero="L01_V02_SumaDeVectores-I", escena="4")

# +call: montandoHD(video="L01_V02_SumaDeVectores-I")

# +call: fade(video="L01_V02_SumaDeVectores-I")

*** COMMENT Código obtener subíndices de caracteres en expresiones

Este código indexa los elementos de expresiones en \LaTeX para
facilitar la transformación de una expresión en otra mediante la
transformación de unos elementos en otros.

#+name: Obtención de subíndices de caracteres en expresiones
#+BEGIN_SRC python  :results discard

import itertools
def get_sub_indexes(tex):
    ni = VGroup()
    colors = itertools.cycle([RED,TEAL,GREEN,BLUE,PURPLE])
    for i in range(len(tex)):
        n = Text(f"{i}",color=next(colors)).scale(0.7)
        n.next_to(tex[i],DOWN,buff=0.01)
        ni.add(n)
    return ni

#+END_SRC



* Rodando: 1,2,3\dots ¡acción!


#+call: rodando(fichero="L01_V02_SumaDeVectores-I", escena="1,2")

# +call: FusionSumaR3()

# +call: FusionSumaRn()

#+call: montando(video="L01_V02_SumaDeVectores-I")

#+call: fade(video="L01_V02_SumaDeVectores-I")


#+call: rodandoHD(fichero="L01_V02_SumaDeVectores-I", escena="1,2,3,4,5,6,7,8")

# +call: FusionSumaR3_HD()

# +call: FusionSumaRn_HD()

#+call: montandoHD(video="L01_V02_SumaDeVectores-I")

#+call: fade(video="L01_V02_SumaDeVectores-I")

**** Generamos un fichero ~mpeg~ por cada escena

- Versión de poca calidad:

#+call: rodando(fichero="L01_V02_SumaDeVectores-I", escena="1,2")

#+name: rodando
#+BEGIN_SRC bash :var fichero="L01_V02_SumaDeVectores-I" :var escena="1" :dir /home/marcos/CloudStation/ReposGH/Docencia/VideosMates2/lib :results silent
echo $escena | manim -pql $fichero.py --disable_caching
#+END_SRC

- Versión con calidad HD1080:

#+call: rodandoHD(fichero="L01_V02_SumaDeVectores-I", escena="1,2")

#+name: rodandoHD
#+BEGIN_SRC bash :var fichero="L01_V02_SumaDeVectores-I" :var escena="1" :dir /home/marcos/CloudStation/ReposGH/Docencia/VideosMates2/lib :results silent
echo $escena | manim -qh $fichero.py --disable_caching
#+END_SRC

