L01-V02-SumaDeVectores-I.html
<div id="outline-container-orgf71fdc5" class="outline-2">
<h2 id="orgf71fdc5"><span class="section-number-2">2.</span> Trozos comunes de código</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0997ddd" class="outline-3">
<h3 id="org0997ddd"><span class="section-number-3">2.1.</span> Carga de la librería Manim y NacAL</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python" id="org60c531c"><span style="color: #0000FF;">from</span> manim <span style="color: #0000FF;">import</span> *
<span style="color: #0000FF;">from</span> manim_voiceover <span style="color: #0000FF;">import</span> VoiceoverScene
<span style="color: #0000FF;">from</span> manim_voiceover.services.azure <span style="color: #0000FF;">import</span> AzureService
<span style="color: #0000FF;">import</span> nacal <span style="color: #0000FF;">as</span> nc
<span style="color: #0000FF;">import</span> sympy <span style="color: #0000FF;">as</span> sp
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">PARA LA TRADUCCI&#211;N (pero no s&#233; generar los v&#237;deos traducidos)</span>
<span style="color: #0000FF;">from</span> manim_voiceover.translate <span style="color: #0000FF;">import</span> get_gettext
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">It is good practice to get the LOCALE and DOMAIN from environment variables</span>
<span style="color: #0000FF;">import</span> os
<span style="color: #BA36A5;">LOCALE</span> = os.getenv(<span style="color: #008000;">"LOCALE"</span>)
<span style="color: #BA36A5;">DOMAIN</span> = os.getenv(<span style="color: #008000;">"DOMAIN"</span>)
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">The following function uses LOCALE and DOMAIN to set the language, and</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">returns a gettext function that is used to insert translations.</span>
<span style="color: #BA36A5;">_</span> = get_gettext()
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb633191" class="outline-3">
<h3 id="orgb633191">Definición de algunas subclases con definiciones generales</h3>
<div class="outline-text-3" id="text-orgb633191">
<div class="org-src-container">
<pre class="src src-python" id="org96ab3b3">
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">MiEscenaConVoz</span>(VoiceoverScene):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">pausa_muy_corta</span>(<span style="color: #0000FF;">self</span>, n=0.3):
        <span style="color: #0000FF;">self</span>.wait(n)
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">pausa_corta</span>(<span style="color: #0000FF;">self</span>, n=0.5):
        <span style="color: #0000FF;">self</span>.wait(n)
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">pausa</span>(<span style="color: #0000FF;">self</span>, n=1):
        <span style="color: #0000FF;">self</span>.wait(n)
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">pausa_media</span>(<span style="color: #0000FF;">self</span>, n=1.5):
        <span style="color: #0000FF;">self</span>.wait(n)
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">pausa_larga</span>(<span style="color: #0000FF;">self</span>, n=3):
        <span style="color: #0000FF;">self</span>.wait(n)
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">pausa_muy_larga</span>(<span style="color: #0000FF;">self</span>, n=5):
        <span style="color: #0000FF;">self</span>.wait(n)

    &lt;&lt;Cr&#233;ditos en distintas partes de la pantalla&gt;&gt;
         
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python" id="org85cb0d2"><span style="color: #0000FF;">def</span> <span style="color: #006699;">creditos</span>(<span style="color: #0000FF;">self</span>, variante=1):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">analisis_opcion_elegida</span>(tipo):
        <span style="color: #036A07;">'An&#225;lisis de las opciones de eliminaci&#243;n elegidas'</span>
        <span style="color: #BA36A5;">lista</span> = [100,20,10,4,2,1]
        <span style="color: #BA36A5;">opcion</span> = <span style="color: #006FE0;">set</span>()
        <span style="color: #0000FF;">for</span> t <span style="color: #0000FF;">in</span> lista:
            <span style="color: #0000FF;">if</span> (tipo - (tipo % t)) <span style="color: #0000FF;">in</span> lista:
                opcion.add(tipo - (tipo % t))
                <span style="color: #BA36A5;">tipo</span> = tipo % t
        <span style="color: #0000FF;">return</span> opcion    
    <span style="color: #D0372D;">copyright</span> = Tex(r<span style="color: #008000;">"\textcopyright{\;} 2024\; Marcos Bujosa  "</span>)
    <span style="color: #0000FF;">if</span> 1 <span style="color: #0000FF;">in</span> analisis_opcion_elegida(variante):
        <span style="color: #BA36A5;">stampDcha</span>  = VGroup(<span style="color: #D0372D;">copyright</span>.copy()).rotate( PI/2).scale(0.5).to_edge(RIGHT, buff=0.1).set_color(GRAY_D)
        <span style="color: #0000FF;">self</span>.add(stampDcha)
    <span style="color: #0000FF;">if</span> 2 <span style="color: #0000FF;">in</span> analisis_opcion_elegida(variante):
        <span style="color: #BA36A5;">stampIzda</span>  = VGroup(<span style="color: #D0372D;">copyright</span>.copy()).rotate(-PI/2).scale(0.5).to_edge(LEFT, buff=0.1).set_color(GRAY_D)
        <span style="color: #0000FF;">self</span>.add(stampIzda)
    <span style="color: #0000FF;">if</span> 4 <span style="color: #0000FF;">in</span> analisis_opcion_elegida(variante):
        <span style="color: #BA36A5;">stampBottom</span>= VGroup(<span style="color: #D0372D;">copyright</span>.copy()).rotate(    0).scale(0.5).to_edge(DOWN, buff=0.1).set_color(GRAY_D)
        <span style="color: #0000FF;">self</span>.add(stampBottom)
    <span style="color: #0000FF;">if</span> 10 <span style="color: #0000FF;">in</span> analisis_opcion_elegida(variante):
        <span style="color: #BA36A5;">stampTop</span>   = VGroup(<span style="color: #D0372D;">copyright</span>.copy()).rotate(    0).scale(0.5).to_edge(  UP, buff=0.1).set_color(GRAY_D)
        <span style="color: #0000FF;">self</span>.add(stampTop)
        
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python" id="org3c8f25c"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ZCreditos</span>(Scene):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #D0372D;">copyright</span> = Tex(r<span style="color: #008000;">"\textcopyright{\;} 2024 \; Marcos Bujosa"</span>)
        <span style="color: #BA36A5;">github</span> = Tex(r<span style="color: #008000;">"\texttt{https://github.com/mbujosab}"</span>).next_to(<span style="color: #D0372D;">copyright</span>, DOWN)
        <span style="color: #BA36A5;">CGG</span>  = VGroup(<span style="color: #D0372D;">copyright</span>,github).scale(1.1)
        <span style="color: #0000FF;">self</span>.add(CGG)
        <span style="color: #0000FF;">self</span>.wait(10)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4d070db" class="outline-2">
<h2 id="org4d070db"><span class="section-number-2">3.</span> Rodando: 1,2,3&hellip; ¡acción!</h2>
<div class="outline-text-2" id="text-3">
</div>
<ol class="org-ol">
<li><a id="org1a1c421"></a>Generamos un fichero <code>mpeg</code> por cada escena<br />
<div class="outline-text-5" id="text-3-0-0-1">
<ul class="org-ul">
<li>Versión de poca calidad:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="org809aebb"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">escena</span> | manim -pql $<span style="color: #BA36A5;">fichero</span>.py --disable_caching
</pre>
</div>

<ul class="org-ul">
<li>Versión con calidad HD1080:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="orgef62eae"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">escena</span> | manim -qh $<span style="color: #BA36A5;">fichero</span>.py --disable_caching
</pre>
</div>
</div>
</li>
